{
  "name": "Stone Age",
  "description": "The age which you must make do with tools made from stone. You will learn the basics of survival",
  "quests": [
    {
      "name": "Welcome to Terrafirmacraft",
      "description": "Where we learn everything about Minecraft has changed.",
      "x": 25,
      "y": 12,
      "icon": {
        "id": "terrafirmacraft:Grass"
      },
      "tasks": [
        {
          "type": "DETECT",
          "description": "Picking up sticks and rocks",
          "longDescription": "Terrafirmacraft or TFC is a total conversion that changes most of the things we know about how to play Minecraft. The first thing you will want to do to survive is to go and find some sticks and rocks. Sticks and rocks can be found randomly on the ground and sticks also from breaking leaves on trees.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.stick"
              },
              "required": 7,
              "precision": "ORE_DICTIONARY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.LooseRock",
                "damage": 11
              },
              "required": 7,
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 13,
          "amount": 5
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ]
    },
    {
      "name": "Knapping 101",
      "description": "Stone Tool Fundamentals.",
      "x": 63,
      "y": 12,
      "icon": {
        "id": "terrafirmacraft:item.LooseRock",
        "damage": 13
      },
      "prerequisites": [
        "Welcome to Terrafirmacraft"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Rocks into tool heads",
          "longDescription": "To begin knapping a stone tool you need to have a stack of least 2 rocks. Use the andesite rocks provided, right click while they are in your hotbar to open the knapping interface. The patterns for knapping are available in NEI.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Axe Head"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Fundamental Tree Feller",
          "longDescription": "Combine your stone axe head with a stick or a bone in your crafting slot to craft your first stone axe. In TFC when you break a log in a tree the entire tree above that block will break and the leaves will instantly despawn and not drop any saplings or sticks. So be sure to collect what you need from those leave before chopping. Stone axes are key early weapons. In TFC weapons deal different types of damage. The axe deals slashing damage. Slashing damage is effective against Zombies and Enderman.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Axe"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 13,
          "amount": 16
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 12,
          "amount": 16
        },
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 19,
          "amount": 16
        }
      ]
    },
    {
      "name": "Pottery",
      "description": "Learning how to make and fire clay items.",
      "x": 186,
      "y": 12,
      "icon": {
        "id": "terrafirmacraft:item.Small Vessel",
        "damage": 1
      },
      "prerequisites": [
        "More on stone tools"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Find a clay deposit",
          "longDescription": "To find a clay deposits look for golden rod flowers growing on grass. Don\u0027t bother looking for clay in dry grass areas as clay needs water to form.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Flora"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Clay"
              },
              "required": 5
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Small Pottery Items",
          "longDescription": "You must have a stack of at least 5 clay in your hand to open up crafting GUI with right-click. The clay will not be consumed until you complete the task, so if you make a mistake just close the window and try again.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Small Vessel"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Jug"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.ClayBowl"
              },
              "required": 2
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Large Pottery items",
          "longDescription": "As before just craft the large vessel from 5 clay.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Vessel"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Fire Pit Kiln",
          "longDescription": "A pit kiln is made in a one block deep hole.  Each kiln requires 8 straw and 8 logs to fire. You can place a unfired clay object by shift clicking into the hole. After you have placed up to four small items or one large item, fill the pit with 8 straw and then 8 logs with right click. Light the logs with a fire starter or drop a torch onto the logs to start the kiln.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Jug",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Small Vessel",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:Vessel",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.ClayBowl",
                "damage": 1
              },
              "required": 2
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Clay",
          "amount": 16
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Jug",
          "damage": 1
        },
        {
          "id": "terrafirmacraft:item.Small Vessel",
          "damage": 1
        },
        {
          "id": "HardcoreQuesting:hearts"
        }
      ]
    },
    {
      "name": "More on stone tools",
      "description": "Where you learn about tools added by TFC that you will need to survive.",
      "x": 98,
      "y": 11,
      "icon": {
        "id": "terrafirmacraft:item.IgIn Stone Axe"
      },
      "prerequisites": [
        "Knapping 101"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Stone Javelin",
          "longDescription": "A javelin is a ranged weapon that can also be used in melee. The javelin does piercing damage which is more effective against bears, Creepers, Endermen, and wolves. Skeletons are immune to piercing damage so don\u0027t bother using it against them.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Javelin"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Stone Knife",
          "longDescription": "The knife is a multi-purpose tool that can cut long grass into straw, process grains, shear sheep, split food into smaller pieces, cut the decay off food, and be used as a piercing weapon as a last resort.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Stone Knife"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Stone Hammer",
          "longDescription": "The stone hammer is primarily used to make the stone anvil, which will be useful later. Hammers deal crushing damage, which is most effective against Enderman and Skeletons. This is the only stone age weapon that are effective against skeletons. In TechNodefirmacraft the hammer is also a valuable tool for the builder. Building blocks are easily broken, but don\u0027t use it when the block is touching natural stone, dirt or other natural blocks.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Stone Hammer"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.IgIn Stone Javelin Head",
          "amount": 4
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Stone Knife Blade"
        },
        {
          "id": "terrafirmacraft:item.Stone Hammer Head"
        },
        {
          "id": "HardcoreQuesting:hearts"
        }
      ]
    },
    {
      "name": "Food and Water",
      "description": "Food from the wilds.",
      "x": 186,
      "y": 85,
      "icon": {
        "id": "minecraft:fish"
      },
      "prerequisites": [
        "More on stone tools",
        "Pottery"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Food",
          "longDescription": "Food is a constant concern in TFC. In early days you will need to explore to find various wild food. Crops will randomly spawn in the world, but they may not be mature and so harvesting will only give you seeds. You\u0027ll need to decide if you have time to get a farm going or you want to come back later. You\u0027ll also find many wild animals that can provide meat. Remember only deer and pheasants can respawn...slowly. Cows, chickens, pigs, sheep and horses will only ever spawn on world generation. You\u0027ll also get very little meat from animals until you raise your butchery skill. So early game seaweed is a staple food. You\u0027ll find seaweed along the coasts in salt water, but the farther north you are the less likely you will see it. Harvest it by right clicking with a knife.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Sea Weed",
                "nbt": "{foodWeight:40.0f,foodDecay:-21.96039f,decayTimer:2294}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Drinkable Water",
          "longDescription": "You need to keep yourself hydrated with fresh water. You can drink from any pond if it has cat of nine tails in it or from rivers and streams. Right click on fresh water, be sure you are targeting the block under or beside the water block. Sipping water is slow, but you can carry water in a jug. You can quickly fill a large amount of your hydration with a jug.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Jug",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Clay",
          "amount": 8
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ]
    },
    {
      "name": "Understanding Food Basics",
      "description": "Where collect for our farm.",
      "x": 185,
      "y": 142,
      "icon": {
        "id": "terrafirmacraft:item.Rye Whole",
        "nbt": "{foodWeight:28.8f,foodDecay:-19.800676f,decayTimer:2763}"
      },
      "prerequisites": [
        "Food and Water",
        "Stone Hoe"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Crops",
          "longDescription": "As you explore your world you will find more and more food. Berry bushes, fruit trees and crops. Mature crops will give both seed bags and a food item. The seed bag can then be planted on farmland and will slowly grow depending on a lot of factors. The food item that mature crops drop will have a weight and will decays over time causing the weight to go down. There are two shortcut keys for processing food. Hover over any food item and press D to trim decay off all food. Hover over a food item and press S to stack all of the food into max sized stacks. Decay can also be trimmed by placing food in crafting grid with a knife. If there is no decay then the food stack will be split in half. You process whole grains by crafting them with a knife giving grains and straw. It is best to store grains in this form as they have a slower decay rate. The grains can be used to feed animals or processed further to make bread. Get any seed bag to complete this quest.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Seeds Wheat"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Clay",
          "amount": 16
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ]
    },
    {
      "name": "Firepits",
      "description": "Where we learned the primitive means to cook things.",
      "x": 25,
      "y": 56,
      "icon": {
        "id": "terrafirmacraft:item.Firestarter"
      },
      "prerequisites": [
        "Welcome to Terrafirmacraft"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Making fires",
          "longDescription": "The first thing you will need to make a firepit is a fire starter. You\u0027ll need two sticks to rub together.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Firestarter"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Temporary lights",
          "longDescription": "The firepit is used to craft torches, cook food and more. The firepit is made by throwing 3 sticks on the ground and lighting that block by right-clicking with the firestarter. If you are successful a firepit will appear. Throw a piece of straw down with the sticks to increase the odds of a firepit forming. Once you have the firepit is formed you will need to fuel it with logs, which can be placed in the left slots or by dropping on the firepit. You\u0027ll also need to protect your firepit from rain or it will go out. Things you want to heat go in the top rightmost slot and will drop down to one of the lower slots when complete. Place a stick in to make a torch. Torches are your early source of light, but they burn out over time or if they are exposed to rain. You can relight torches by right clicking it with a lit torch, you can craft more torches by right-clicking with a stick and extinguish them by right-clicking with anything other than a torch or stick. Crafting torches in firepits or forges gives 2 torches per stick or 1 from lighting from another torch. Although firepits won\u0027t light blocks on fire we don\u0027t suggest you walk on them.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Torch"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Log",
          "amount": 4
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ]
    },
    {
      "name": "Hide Bed",
      "description": "To uncomfurtable to sleep on, but useful.",
      "x": 72,
      "y": 66,
      "icon": {
        "id": "minecraft:bed"
      },
      "prerequisites": [
        "More on stone tools"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Primitive bedding",
          "longDescription": "You can craft a basic bed by placing a large raw hide on two blocks of thatch. To get a large raw hide you will have to kill a bear or large cow. While you cant sleep on it, it will set your spawn point. This is an in world craft so place the 2 thatch blocks down and right-click with the large raw hide.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Hide",
                "damage": 2
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:Thatch"
              },
              "required": 2
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 13,
          "amount": 16
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ]
    },
    {
      "name": "Looking for metals",
      "description": "Where we learn to gather enough copper to make our first metal tools.",
      "x": 236,
      "y": 57,
      "icon": {
        "id": "terrafirmacraft:item.Small Ore"
      },
      "prerequisites": [
        "Pottery"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Looking for Nuggets",
          "longDescription": "To leave the stone age, you are going to need to find copper ore. There are three types of ore that produce copper when smelted, Native Copper, Malachite, and Tetrahedrite. The best way to get nuggets is to explore. Mark the locations where you find them as an ore vein will be nearby. Later you can use a prospector\u0027s pick to find the vein itself. A gold pan or sluice can be used as a last resort for getting the nuggets you need. This task will accept any of the 3 types of copper.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Small Ore"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Desperation",
          "longDescription": "So you\u0027ve not had luck with getting enough copper for your first tool. You are desperate, well there is gold panning. Put a ceramic bowl in the crafting grid to craft a Gold Pan. Now that you have a gold pan, you will need to sift through sand or gravel under running water to try and find bits of native ores. To do this first right click on a block of sand or gravel to fill the pan. Then right-click on running water. You may also find bits of native copper, gold, silver or platinum as you pan depending on your prospecting skill. Not a terrible activity during your first few nights hiding, but be aware you will overwork the chunk in time.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.GoldPan"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.GoldPan"
        },
        {
          "id": "terrafirmacraft:item.Small Ore",
          "amount": 2
        },
        {
          "id": "HardcoreQuesting:hearts"
        }
      ]
    },
    {
      "name": "Stone Hoe",
      "description": "Where we learned how to use our new hoe",
      "x": 124,
      "y": 63,
      "icon": {
        "id": "terrafirmacraft:item.IgEx Stone Hoe"
      },
      "prerequisites": [
        "More on stone tools"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Hoes with extra modes",
          "longDescription": "To start your farm you\u0027ll need to knap a hoe. With the hoe till grass, not dirt, to get a farmland block full of nutrient. Unlike vanilla farmland does not need water, but farmland hydrated with fresh water will help the crops grow faster. The stone hoe, using the mode change key, will also let you check if your farmland is hydrated and if the plant on it is ready to be harvested. As you harvest more mature crops your agriculture skill will raise. This increases your chance at getting extra seeds and will unlock information on the nutrients needed for different crops and found in farmland.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Hoe"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Seeds Rye"
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Seeds Wheat"
        },
        {
          "id": "terrafirmacraft:item.Seeds Carrot"
        },
        {
          "id": "terrafirmacraft:item.Seeds Soybean"
        }
      ]
    },
    {
      "name": "Fruit Trees",
      "description": "Apple. Orange you glad I didn\u0027t say Banana?",
      "x": 65,
      "y": 116,
      "icon": {
        "id": "terrafirmacraft:item.FruitSapling"
      },
      "prerequisites": [
        "Stone Hoe"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Getting a Sapling",
          "longDescription": "An important food is fruit. Fruit trees are one of two sources of fruit in TFC. Unlike normal trees you get saplings by breaking the side cross branches with an axe or saw. They will regrow. Breaking any other branch will kill tree. Unlike other saplings once you place you can\u0027t pick them back up. So place carefully.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.FruitSapling"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.FruitSapling"
        },
        {
          "id": "terrafirmacraft:item.FruitSapling",
          "damage": 6
        },
        {
          "id": "terrafirmacraft:item.FruitSapling",
          "damage": 2
        },
        {
          "id": "terrafirmacraft:item.FruitSapling",
          "damage": 7
        }
      ]
    },
    {
      "name": "Berry Bushes",
      "description": "Decorative and functional.",
      "x": 117,
      "y": 123,
      "icon": {
        "id": "terrafirmacraft:BerryBush",
        "damage": 3
      },
      "prerequisites": [
        "Stone Hoe"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Find a Berry Bush",
          "longDescription": "Berry bushes can be found throughout your world. There is no tool or trick to collect them, but they do need to be planted on grass. This task accepts any berry bush.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:BerryBush",
                "damage": 1
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 1
        },
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 2
        },
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 3
        },
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 4
        }
      ]
    },
    {
      "name": "Salad Bar",
      "description": "Don\u0027t drop the bowl.",
      "x": 248,
      "y": 14,
      "icon": {
        "id": "terrafirmacraft:item.Salad",
        "nbt": "{foodWeight:0.0f,foodDecay:0.0f,FG:[-1,-1,-1,-1,],decayTimer:2161}"
      },
      "prerequisites": [
        "Pottery"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "You Don\u0027t Win Friends with...",
          "longDescription": "Eating each food category seperately is not efficient. By eating salads you not only combine multiple food groups, you gain saturation and will slow how quickly levels of food groups not in salad decrease. To make a salad you need a food prep surface. Right-click the top of any solid block with a knife to create a food surface. Enter the GUI to make your salad. You can have a food group twice, but each ingredient must be unique. Salads are 20oz of food.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Salad",
                "nbt": "{foodWeight:0.0f,foodDecay:0.0f,FG:[-1,-1,-1,-1,],decayTimer:2161}"
              },
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.ClayBowl",
          "damage": 1,
          "amount": 4
        },
        {
          "id": "HardcoreQuesting:hearts",
          "damage": 3
        }
      ]
    }
  ],
  "reputation": []
}